Revit 2027 API
CopyPasteOptions.GetDuplicateTypeNamesHandler Method
 Returns current duplicate type names handler or null if none is set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IDuplicateTypeNamesHandler GetDuplicateTypeNamesHandler()
Public Function GetDuplicateTypeNamesHandler As IDuplicateTypeNamesHandler
public:
IDuplicateTypeNamesHandler^ GetDuplicateTypeNamesHandler()
member GetDuplicateTypeNamesHandler : unit -> IDuplicateTypeNamesHandler
Return Value
IDuplicateTypeNamesHandler
See Also
Reference
CopyPasteOptions Class
Autodesk.Revit.DB Namespace